In [16]:
import pandas as pd
import numpy as np

In [17]:
A = pd.DataFrame({'a':[1,2,3], 'b':[4,np.NaN,6], 'c':[7,8,9]})

In [18]:
A.rename(columns={'a':'new_a'})

   new_a    b  c
0      1  4.0  7
1      2  NaN  8
2      3  6.0  9

In [19]:
A['rank'] = A['a'].rank()

In [20]:
A

   a    b  c  rank
0  1  4.0  7   1.0
1  2  NaN  8   2.0
2  3  6.0  9   3.0

In [21]:
A.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       2 non-null      float64
 2   c       3 non-null      int64
 3   rank    3 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 224.0 bytes

In [22]:
A.shape

(3, 4)

In [25]:
A.count() # count non-NA value

a       3
b       2
c       3
rank    3
dtype: int64

In [26]:
A.add(2) # add 2 to all values

   a    b   c  rank
0  3  6.0   9   3.0
1  4  NaN  10   4.0
2  5  8.0  11   5.0

In [29]:
A.loc[0, 'a']

1

In [30]:
B = pd.DataFrame({'a':[1,2,3], 'b':[4,np.NaN,6], 'c':[7,8,10]})

In [31]:
pd.concat([A,B])

   a    b   c  rank
0  1  4.0   7   1.0
1  2  NaN   8   2.0
2  3  6.0   9   3.0
0  1  4.0   7   NaN
1  2  NaN   8   NaN
2  3  6.0  10   NaN